[
{"author": "Customer Service Representative at Farmers Insurance Group was asked...", "question": " What is your weakest quility."},
{"author": "Data Scientist at CCRi was asked...", "question": " Explain Python."},
{"author": "Data Scientist at Zenefits was asked...", "question": " Bayes' Formular: Marbles: There are 30 red marbles and 10 black marbles in Urn #1. You have 20 red and 20 Black marbles in Urn 2. Randomly you pull a marble from the random urn and find that it is red. What is the probability that it was pulled from Urn #1"},
{"author": "Data Scientist at Zenefits was asked...", "question": " Two random cards numbered from 1,2...100 are pulled from the deck. What is the probability that one number doubles the other from the deck. "},
{"author": "Data Scientist at Zenefits was asked...", "question": " Alice and Bob take turns in rolling a fair dice. Whoever gets \"6\" first wins the game. Alice starts the game. What are the chances that Alice wins. "},
{"author": "Data Scientist at Facebook was asked...", "question": " Write C++ code to copy a graph, once done whats the algorithmical complexity of this"},
{"author": "Data Scientist at Fino Consulting was asked...", "question": " Why is data important? (or something along those lines; I'd call this an unexpected question)"},
{"author": "Data Scientist at Spotify was asked...", "question": " given n samples from a uniform distribution [0, d], how to estimate d?"},
{"author": "Data Scientist at Corcoran Group was asked...", "question": " What are generators in python?"},
{"author": "Retail Coverage Merchandiser at Acosta was asked...", "question": " How my experience would help me in this capacity."},
{"author": "Data Scientist at Swiss Re was asked...", "question": " What machine learning project have you done? - PCA OK, let's talk about PCA. Tell me what it stands for? - SVD How is SVD defined? How do you calculate orthogonal vectors? etc.."},
{"author": "Data Scientist at Tesla was asked...", "question": " There are three questions in the interview. 1. Probability questions: There are 100 product and 25 of them is bad. What is the confident interval. 2. Maximum likelihood questions: solve exponential function and get the maximum likelihood estimator. 3. Use \"dplyr\" package in R to solve a case."},
{"author": "Data Scientist at PURE Group of Insurance Companies was asked...", "question": " I was asked questions about my presentation and Hiring Manager was supportive. They asked a lot of questions majorly on my resume but also asked some real time challenging questions based on their current requirement. I got disappointed when I asked a question to Senior Manager about the company and I got a very bad response. I asked about different projects which they are working on so that I could get a better understanding about Data Science use cases and the Senior manager did not give a professional reply and stated that 'This should not be your concern.' There were other questions as well where I felt that Senior Manager is being very rude to the interviewee. Apart from this all the other interviewers were very warm and kind."},
{"author": "Data Scientist at Weather Analytics was asked...", "question": " Tell us about projects you worked on."},
{"author": "Data Scientist at OnDeck was asked...", "question": " machine learning algorithm questions mostly on logistic regression."},
{"author": "Data Scientist at ActionIQ was asked...", "question": " Given a string, create a list of all possible anagrams."},
{"author": "Data Scientist Interview at First Derivatives was asked...", "question": " Willing to travel?"},
{"author": "Data Scientist Interview at First Derivatives was asked...", "question": " What skills do you have that will help you succeed at FD? "},
{"author": "Data Scientist at Capital One was asked...", "question": " implement a function to calculate matrix sum. calculate the probability of coin head"},
{"author": "Data Scientist Interview at First Derivatives was asked...", "question": " What your expectations from FD?"},
{"author": "Data Scientist at Securonix was asked...", "question": " How can you predict future from historical data?"},
{"author": "Data Scientist at Jefferies was asked...", "question": " How do you build a recommendation algo for securities?"},
{"author": "Data Scientist Interview at First Derivatives was asked...", "question": " What does FD do? News? Clients? Delta platform software ? Kdb+ Database? The Capital Market training programme? "},
{"author": "Data Scientist Interview at First Derivatives was asked...", "question": " Why FD? What is your motivation to apply to FD? "},
{"author": "Software Engineer,, Software Engineer(Internshi), Data Scientist at Facebook was asked...", "question": " They will ask you to design a very simple thing. Be prepared to innovate on the spot."},
{"author": "Data Scientist Interview at First Derivatives was asked...", "question": " Background: degree, GPA, .."},
{"author": "Data Scientist at Via Transportation was asked...", "question": " Rides on the Upper East Side receive lower than average ratings, what data would you gather and how would you model this? "},
{"author": "Data Scientist at J.P. Morgan was asked...", "question": " Dynamic Prediction study"},
{"author": "Data Scientist at Paperless Post was asked...", "question": " What is a API? What is a ETL Pipeline?"},
{"author": "Entry Level Data Scientist at Electronic Arts was asked...", "question": " general machine learning questions one algorithm question found in leetcode"},
{"author": "Data Scientist at Capital One was asked...", "question": " Describe the modeling process from the beginning."},
{"author": "Data Scientist (Marketing Analytics) at OnDeck was asked...", "question": " Like basic python questions and basic sql query questions."},
{"author": "Entry Level Data Scientist at Electronic Arts was asked...", "question": " general machine learning questions one algorithm question found in leetcode"},
{"author": "Data Scientist at OnDeck was asked...", "question": " Like how to implement statistics mean function in python, how to flatten a nested list in Python, and also some SQL easy questions, like basic select query"},
{"author": "Data Scientist at 6sense was asked...", "question": " Walk through the project details (predictive modeling project)"},
{"author": "Data Scientist at OnDeck was asked...", "question": " return the largest palindrome from a very long string."},
{"author": "Data Scientist at Yodle was asked...", "question": " You are playing a game of HORSE with a replica of yourself, so your shooting percentage is probability p (for the both of you). The rules are that if you make a basket and your replica misses, then you win the game. If your replica makes the basket and you miss, then you lose. If you both miss, then you start over again. What is the expected probability that you will win the game?"},
{"author": "Data Scientist at Centiment was asked...", "question": " How to optimize the model?"},
{"author": "Data Scientist at The Home Depot was asked...", "question": " How do you determine the price of a product without any information about it?"},
{"author": "Data Scientist at Amazon was asked...", "question": " Coding: Given a bar plot and imagine you are pouring water from the top, how to qualify how much water can be kept in the bar chart. "},
{"author": "Data Scientist at ActionIQ was asked...", "question": " Basic coding question -- how do you do \"group by\" operations?"},
{"author": "Data Scientist at Civis Analytics was asked...", "question": " Why do you want to work for Civis Analytics?"},
{"author": "Data Scientist at ActionIQ was asked...", "question": " Data challenge -- rank and score 50000 tweets in a text doc based on sentiment (in 3 hours)"},
{"author": "Data Scientist at Commonwealth Bank of Australia was asked...", "question": " They gave exercise to solve."},
{"author": "Junior Data Scientist at Unified was asked...", "question": " sql stuff"},
{"author": "Data Scientist at New York Life was asked...", "question": " Statistical and Machine Learning questions such as: What is ROC curve? Difference between Random Forest and Boosting."},
{"author": "Data Scientist at Riot Games was asked...", "question": " When to use Python and R"},
{"author": "Data Scientist at Fulcrum Analytics was asked...", "question": " Tell me about your background, some brain teasers, ML and stats questions, SQL and Python/R Whiteboard questions."},
{"author": "Driver at Jimmy John's was asked...", "question": " Are you reliable?"},
{"author": "Data Scientist at AOL was asked...", "question": " We got past what I did and then walked through some of the details of a problem the team was working on. An entity matching problem with many attributes."},
{"author": "Data Scientist at Capital One was asked...", "question": " Biz case study interview, behaviorial, technical case study, technical interview."},
{"author": "Data Scientist at Feedzai was asked...", "question": " Q: explain the kaggle challenge dataset, what did you see in data, what features did you use and why?"},
{"author": "Data Scientist Interview at Correlation One was asked...", "question": " related to predicting stock values."},
{"author": "Data Scientist at Wish was asked...", "question": " Basic question about String manipulation."},
{"author": "Data Scientist at Grab was asked...", "question": " What is overfitting and how you deal with it"},
{"author": "Data Scientist at Facebook was asked...", "question": " Fundamental Algorithm questions that every Computer Scientist should know. "},
{"author": "Data Scientist at Plated was asked...", "question": " how would you design such recommendation system and follow up questions"},
{"author": "Data Scientist at AllianceBernstein was asked...", "question": " What is bias variance trade off? Does K-NN require you to scale your features? How would you perform classification if you had to use linear regression? What are assumptions of linear regression? How would you assess your model? Lots of questions relating to recall, precision, etc."},
{"author": "Data Scientist at SoundCloud was asked...", "question": " What is one thing you'd like to accomplish as a data scientist at SoundCloud?"},
{"author": "Data Scientist at Endgame was asked...", "question": " How do you describe data scientist?"},
{"author": "Data Scientist at Temasek was asked...", "question": " What would your managers (at my previous internship) say about you if I call them?"},
{"author": "Data Scientist at Via Transportation was asked...", "question": " If we want to build a logistic regression model with the distance (between the rider's current location and the pickup location) as the feature and the rider's acceptance as output, what would be the meaning of the coefficient of the feature, how about the intercept? What will happen to the model if we change the scale of the distance (from mile to km, or from km to m)?"},
{"author": "Data Scientist at Bowery Farming was asked...", "question": " Most questions related to thinking through problems typical to the role and discussing possible solutions"},
{"author": "Data Scientist at S&P Global Ratings was asked...", "question": " What are ways to do feature selections"},
{"author": "Data Scientist at Simon Data was asked...", "question": " Tell me how logistic regression works? "},
{"author": "Data Scientist at SoundCloud was asked...", "question": " \"For a user X, recommend 5 playlists they would like that they haven’t heard before. You can attempt this via SQL or any other programming language of your choice. Please explain your logic.\""},
{"author": "Data Scientist at Bloomberg L.P. was asked...", "question": " I was asked several times to describe a situation where I had a conflict with a manager to the point where it made me wonder if they have a lot of conflicts in their department."},
{"author": "Data Scientist at Credit Acceptance was asked...", "question": " What is the difference between a left join and a right join in SQL?"},
{"author": "Data Scientist at Opera Solutions was asked...", "question": " Explain SIFT (scale invariant feature transform) workflow, Support vector Machines, Newton Optimization method."},
{"author": "Data Scientist at Deutsch was asked...", "question": " What programming skills have you worked with in the past?"},
{"author": "Data Scientist at Cognizant Technology Solutions was asked...", "question": " The trend of the data"},
{"author": "Data Scientist at OpenSlate was asked...", "question": " Describe your project"},
{"author": "Data Scientist at VIA was asked...", "question": " user case : why the UES driver rate is low, how you find this problem and how you confirm it, how you solve it."},
{"author": "Data Scientist at Aera Technology was asked...", "question": " Python code"},
{"author": "Data Scientist at Aera Technology was asked...", "question": " SQL"},
{"author": "Data Scientist at Aera Technology was asked...", "question": " basic machine learning"},
{"author": "Data Scientist at Grab was asked...", "question": " Three problems in codility. One sql, two standard algorithm problems."},
{"author": "Data Scientist at TripAdvisor was asked...", "question": " p-value, F1 score definition, case study on fraud detection like given 99% fraud cases and 1% non fraud what model will you take? one case on, given new hotels, how would you set stuff so that they also get booked."},
{"author": "Data Scientist at Dell was asked...", "question": " data science basic questions"},
{"author": "Data Scientist at Capital One was asked...", "question": " Tech: conceptual -- time series, clustering, data munging, experience working with \"real world\" data. Discussion about my previous statistical work (academic research in astronomy)."},
{"author": "Data Scientist at OnDeck was asked...", "question": " Talk about the projects you worked on "},
{"author": "Data Scientist at Intent Media was asked...", "question": " Describe A/B Testing and Statistical Significance to a non-technical audience."},
{"author": "Data Scientist at Wayfair was asked...", "question": " Case study on the price tag"},
{"author": "Data Scientist at EY was asked...", "question": " Standard behavioral stuff (tell me about a time you had a conflict with your boss, etc.)"},
{"author": "Data Scientist at Fino Consulting was asked...", "question": " How would you build profiles for user searches on google."},
{"author": "Data Scientist at CKM Advisors was asked...", "question": " Size the tobacco market in the united states"},
{"author": "Data Scientist at CKM Advisors was asked...", "question": " If you could have any dataset on any topic (resources/collection methods NOT a factor) what would the dataset look like and what would you do with it."},
{"author": "Data Scientist at EY was asked...", "question": " What are you working on right now?"},
{"author": "Data Scientist at Facebook was asked...", "question": " What is the expectation of the variance?"},
{"author": "Data Scientist at Via Transportation was asked...", "question": " The interview questions on the phone were pretty straightforward data science questions regarding feature selection and building models. The technical challenge is described in detail above."},
{"author": "Data Scientist at KPMG was asked...", "question": " Presentation"},
{"author": "Senior Data Scientist at Electric AI was asked...", "question": " What gets you excited to come into work in the morning?"},
{"author": "Data Scientist at Magnetic was asked...", "question": " Generation of random numbers"},
{"author": "Data Scientist at CKM Advisors was asked...", "question": " Most questions are about whether you know the method or not."},
{"author": "Data Scientist at SoundCloud was asked...", "question": " What are you looking for in your next role? "},
{"author": "Data Scientist at Itlize Global was asked...", "question": " Tell me about your experience? What are the data issues have you faced during work? How do you provide predictive analytics in your project? What are the ML models you have used?"},
{"author": "Data Scientist at Fulcrum Analytics was asked...", "question": " Which phase of a data science project would you say you are most interested/competent in?"},
{"author": "Data Scientist at J.P. Morgan was asked...", "question": " do you have any questions？"},
{"author": "Data Scientist at J.P. Morgan was asked...", "question": " what do you learn from it"},
{"author": "Data Scientist at J.P. Morgan was asked...", "question": " what are you doing currently"},
{"author": "Data Scientist at Airbnb was asked...", "question": " A/B testing."},
{"author": "Data Scientist at Branch International was asked...", "question": " Sorting algorithm and determining duplicates. Definitely had a second part but I spent too much time on solving the first"},
{"author": "Data Scientist at Branch International was asked...", "question": " How would you create a database structure so that you can recreate history for past models? How would you save the parameters and the results?"},
{"author": "Data Scientist, Quantitative Analyst at Google was asked...", "question": " How do you estimate the probability of people who are left-hand and own bicycle?"},
{"author": "Data Scientist at CKM Advisors was asked...", "question": " What's the biggest challenge in your teamwork?"},
{"author": "Data Scientist at Knewton was asked...", "question": " There was an overly complex and pointless technical challenge which was a recommender system/test question distribution exercise that probably would've taken 40+ hours to complete and was unpaid. "},
{"author": "Data Scientist at American Express was asked...", "question": " I think that one of the questions they asked was just have no answer. I seriously doubt the validity of the question."},
{"author": "Data Scientist at CKM Advisors was asked...", "question": " What do you see yourself doing in five years"},
{"author": "Data Scientist at Capital One was asked...", "question": " Tell me about a time you used someone else expertise to solve a problem. Tell me about a time you learned something new and solved a problem. "},
{"author": "Data Scientist at Spotify was asked...", "question": " How would you leverage Spotify's data?"},
{"author": "Data Scientist at Capital One was asked...", "question": " Tell me about your experience in neural network?"},
{"author": "Data Scientist at BuzzFeed was asked...", "question": " What type of models I have used in my previous job. What role I would like to have in the case I were accepted."},
{"author": "Data Scientist at First Derivatives was asked...", "question": " Q: What do you know about the CMTP program?"},
{"author": "Data Scientist at Walmart was asked...", "question": " some questions about my NLP project"},
{"author": "Data Scientist at First Derivatives was asked...", "question": " Q: Can you tell us about our kdb products?"},
{"author": "Data Scientist at First Derivatives was asked...", "question": " Q: Have you read anything about us on the news lately?"},
{"author": "Data Scientist at First Derivatives was asked...", "question": " Q: What do you know about First Derivates?"},
{"author": "Data Scientist at Fidelity Investments was asked...", "question": " What would R output if these two matrices were multiplied? (non-matching dimensions)"},
{"author": "Data Scientist at Fidelity Investments was asked...", "question": " How would you make a binary classifier work for multi-class classification?"},
{"author": "Data Scientist at Fidelity Investments was asked...", "question": " What are your favorite packages in R?"},
{"author": "Data Scientist at Pymetrics was asked...", "question": " Derive logistic regression."},
{"author": "Data Scientist at CKM Advisors was asked...", "question": " If you had any dataset you wanted, what would it be and what would you do with it? Explain implementation details."},
{"author": "Data Scientist at Thinkeco was asked...", "question": " understanding datasets and the energy sector"},
{"author": "Data Scientist at Analytic Partners was asked...", "question": " why AP? what's your strength and weakness? some time that you have conflict with your team? go through your details in your resume. "},
{"author": "Data Scientist at Sailthru was asked...", "question": " Under NDA"},
{"author": "Data Scientist at SAP was asked...", "question": " Q: Name a project you've completed before that other people said was not possible, explain how you approached the project in a constructive manner."},
{"author": "Data Scientist at Enigma was asked...", "question": " I don't have a specific question, they sent me a data science challenge consisting of a small dataset and some questions."},
{"author": "Data Scientist at Knewton was asked...", "question": " Write efficient code to find intersections between two lists."},
{"author": "Data Scientist at Deloitte was asked...", "question": " past projects discussion on feature engineering, algorithm identification"},
{"author": "Data Scientist at SAP was asked...", "question": " - cross-lingual word vectors - policy gradients - how to deal with the lack of training data"},
{"author": "Data Scientist at Teachers Pay Teachers was asked...", "question": " it was a phone screen with HR"},
{"author": "Data Scientist at NewYork-Presbyterian Hospital was asked...", "question": " What is the difference between a class and object in Java?"},
{"author": "Data Scientist at Booz Allen Hamilton was asked...", "question": " Describe your most recent data science project briefly"},
{"author": "Data Scientist at Avanade was asked...", "question": " Tell us about a technology you are passionate about."},
{"author": "Data Scientist at Burtch Works was asked...", "question": " How do you optimize model parameters during model building?"},
{"author": "Data Scientist at CKM Advisors was asked...", "question": " Where to place an ad given citi bike data"},
{"author": "Junior Data Scientist at Xoriant was asked...", "question": " Mainly about Codes for different problem and structure of LSTM"},
{"author": "Principal Data Scientist at Aetna was asked...", "question": " Questions about past projects Why did you pick this machine learning model for this problem? Experience with A/B testing"},
{"author": "Data Scientist at Knewton was asked...", "question": " How has an analysis you have done impacted a product?"},
{"author": "Data Scientist at Spotify was asked...", "question": " do something, but we won't tell you what we're looking for."},
{"author": "Data Scientist at Andela was asked...", "question": " Q: How comprehensive do you think data science can be in terms of predicting outcomes for human performance?"},
{"author": "Data Scientist at Via Transportation was asked...", "question": " We want to know where are the riders, how would you do that? "},
{"author": "Data Scientist at CKM Advisors was asked...", "question": " Discuss past projects from your resume"},
{"author": "Data Scientist at Via Transportation was asked...", "question": " When you run into a research problem you can't solve, what would you do?"},
{"author": "Data Scientist at Amazon was asked...", "question": " Tell me about yourself."},
{"author": "Data Scientist at Bloomberg L.P. was asked...", "question": " They asked many questions about programing, Machine Learning, and system design. For the ML one of the questions they asked was about describing Support Vector Machines"},
{"author": "Data Scientist at CKM Advisors was asked...", "question": " Why are you interested in a career in data science?"},
{"author": "Data Scientist at SeatGeek was asked...", "question": " Implement random choice function (non-biased) How to do it by using iterator? If only consider location, how to recommend venue to customer? Explain regression to non-business people. Use Spark to generate sum."},
{"author": "Data Scientist at J.P. Morgan was asked...", "question": " a lot of questions about machine learning algorithms"},
{"author": "Data Scientist at Jet was asked...", "question": " Tell me about something not on your resume"},
{"author": "Client Data Scientist at DemystData was asked...", "question": " Why do you want to work here?"},
{"author": "Data Scientist at Zurich North America was asked...", "question": " Tell me about one project that you are proud of "},
{"author": "Data Scientist at Squarespace was asked...", "question": " 1. Background and relevant experience 2. How their pricing model could be improved to increase customer retention based on life time value?"},
{"author": "Senior Data Scientist at LinkedIn was asked...", "question": " The buy/sell stock days to gain the maximum benefit. "},
{"author": "Senior Data Scientist at Aetna was asked...", "question": " Give an example where you have designed experiments"},
{"author": "Big Data Scientist at HexaCorp was asked...", "question": " What skill would you apply to the field the most? (I had two choices to be a programmer or Data Analyst route)"},
{"author": "Data Scientist at KIPP Foundation was asked...", "question": " R packages, Case study"},
{"author": "Data Scientist at CKM Advisors was asked...", "question": " What's important to you in a company? What's your philosophy for Data Science? Where do you see yourself in 60 years? (60. not a typo.)"},
{"author": "Data Analyst at Cognius was asked...", "question": " How would every boss you've ever had rate you on a scale of 1-10, and describe why."},
{"author": "Senior Data Scientist at Aetna was asked...", "question": " Give an example of experimental design you did"},
{"author": "Data Scientist at ClassPass was asked...", "question": " presentation. A/B testing "},
{"author": "Data Scientist at Oscar Health was asked...", "question": " If you were god how would you... ? (follow up from original debate question)"},
{"author": "Data Scientist at AdTheorent was asked...", "question": " I got a physics question and about three coding questions related to card shuffling. "},
{"author": "Data Scientist at J.P. Morgan was asked...", "question": " Diagnostics of linear and logistic regressions. "},
{"author": "Data Mining Scientist at Etsy was asked...", "question": " Given the set a a b b a a c c b b of unknown length, write an algorithm that figures out which occurs most frequently and with the most continuous repetition."},
{"author": "Data Scientist at BuzzFeed was asked...", "question": " Why do you want to join buzzfeed?"},
{"author": "Data Scientist at Capgemini was asked...", "question": " Questions were basic"},
{"author": "Data Scientist at CKM Advisors was asked...", "question": " What will the prevalence of solar energy be in 2025 (give me a number)? Talk about projects you've worked on. Tell me about how the internet works."},
{"author": "Data Scientist at Via Transportation was asked...", "question": " The written test asked me how I would figure out whether to expand service to Astoria "},
{"author": "Data Scientist at Lynx Analytics was asked...", "question": " SQL, programming, and statement based questions."},
{"author": "Data Scientist at GE was asked...", "question": " how to react in the stressful and changeling environment? How to evaluate the success of a product? Programming Questions and General Questions about PhD Work"},
{"author": "Data Scientist at Barclays was asked...", "question": " How will you evaluate your model on email data set?"},
{"author": "Data Scientist at Capital One was asked...", "question": " (onsite) How would you explain the multinomial distribution and write python code on a whiteboard to represent this distribution"},
{"author": "Data Scientist at Legends was asked...", "question": " Why does logistic linear regression give the best performance in your project?"},
{"author": "Data Scientist at Xero was asked...", "question": " past exp5"},
{"author": "Data Scientist at National Grid USA was asked...", "question": " The analytical question was how to lower the cost of a fleet truck, it is very detail oriented yet very interesting, chanlleging"},
{"author": "Data Scientist at JUUL Labs was asked...", "question": " How would you come up with a model for the rate of substitution of juul products for cigarette products ?"},
{"author": "Data Scientist at Microsoft was asked...", "question": " Describe one of your projects and how much responsibilities you took in delivering the results."},
{"author": "Data Scientist at J.P. Morgan was asked...", "question": " In the first place, they were interested in my financial knowledge. They also were trying to determine how much machine learning I knew."},
{"author": "Data Scientist at Crossover for Work was asked...", "question": " Are you ok with installing spying software on your computer and handling your own taxes?"},
{"author": "Senior Data Scientist at Centiment was asked...", "question": " Define optimal decision boundary achievement in a second generation neural network model"},
{"author": "Data Scientist at C3 was asked...", "question": " 4 questions were asked, 3 multiple choice machine learning based questions. One was coding an algorithm. The coding interface was not that easy to debug in (I'd suggest you try a few Hackerrank questions first, I tried the sample one but I never had to debug so I didn't realise) and I couldn't output the answer in the needed format but on my IDE I got a correct answer."},
{"author": "Data Scientist at Wayfair was asked...", "question": " 1.) Peer data scientist asked a probability problem and gave me a printed out algorithm and asked to explain what it does. Both were very esoteric and I am not sure what they were supposed to test... 2.) Engineers asked simple algorithm in Python and then attempted to ask about how I would detect robots in the server logs to account for them in estimating conversion rates. There were actually a junior and a senior engineer. The junior engineer was just listening in, and the interview was dominated by the senior guy. It probably was partly my fault, but the senior guy asking the question was unable to communicate clearly what he was asking and eventually became preachy and arrogant. 3.) The chief architect asked a geometrical brain teaser (I assume to test my thinking process?) and then we had a chat about the company and primarily his initiatives. 4.) The director of data science asked standard management questions."},
{"author": "Senior Data Scientist at Centiment was asked...", "question": " Describe the steps involved in creating a neural network"},
{"author": "Senior Data Scientist at Centiment was asked...", "question": " Tell me the difference between the maximum margin classfier and the hyperplane"},
{"author": "Data Scientist at CKM Advisors was asked...", "question": " How do you learn new skills?"},
{"author": "Data Scientist at Tapad was asked...", "question": " What is your Masters GPA?"},
{"author": "Data Scientist at CKM Advisors was asked...", "question": " Pick any problem out there and solve it using data."},
{"author": "Data Scientist at Loadsmart was asked...", "question": " Interviews include concepts/questions about algorithms, Python, SQL, case study."},
{"author": "Data Scientist at Capital One was asked...", "question": " Explain the bias-variance tradeoff."},
{"author": "Data Scientist at Point72 was asked...", "question": " behavioral questions about location and fit"},
{"author": "Data Scientist at Xaxis was asked...", "question": " Experience with logistic regression, data challenge on predicting impression probabilities - includes questions on regularisation."},
{"author": "Data Scientist at Unified was asked...", "question": " Resume based. Regression, classifiers."},
{"author": "Data Scientist at First Data was asked...", "question": " The first round interview was a mixture of behavioral and a case interview. It was very conversational and casual, and the interviewer helped me with areas where I stumbled on the case. The case was a long one that tested math, strategy and innovative thinking."},
{"author": "Data Scientist at Tapad was asked...", "question": " What is your Masters GPA?"},
{"author": "Junior Data Scientist at Bloomberg L.P. was asked...", "question": " What is the probability for two un-parallel lines to intersect within a circle?"},
{"author": "Data Scientist at Qeexo was asked...", "question": " Asked to build a predictive model for their acoustic based touch classifications. "},
{"author": "Senior Data Scientist at Spotify was asked...", "question": " How can we deal with extreme values in data?"},
{"author": "Data Scientist at Integral Ad Science was asked...", "question": " Write code to solve "},
{"author": "Data Scientist at Integral Ad Science was asked...", "question": " We're trying to do ____. What do you see as the challenges here? How would you approach this problem if you were in charge of solving it?"},
{"author": "Data Scientist at Grubhub was asked...", "question": " Explain gradient boosting decision trees. "},
{"author": "Data Scientist at Grubhub was asked...", "question": " What do you mean by “fitting the residuals”?"},
{"author": "Data Scientist at Correlation One was asked...", "question": " Basic machine learning"},
{"author": "Data Scientist at Grubhub was asked...", "question": " Do you know what gradient descent is?"},
{"author": "Data Scientist at Grubhub was asked...", "question": " How do random forests treat categorical variables?"},
{"author": "Data Scientist at Facebook was asked...", "question": " the probability of getting a pair, a straight in 52 cards"},
{"author": "Data Scientist at Oscar Health was asked...", "question": " Should the government fund space exploration?"},
{"author": "Data Scientist at Spotify was asked...", "question": " Present a solution to a data assignment with a vague question."},
{"author": "Data Scientist at Spotify was asked...", "question": " Hypothetical business questions related to Spotify's data."},
{"author": "Data Scientist at Capital One was asked...", "question": " Interpret this ANOVA table."},
{"author": "Data Scientist at Capital One was asked...", "question": " What is VIF (in regression output)?"},
{"author": "Data Scientist at Capital One was asked...", "question": " Are false positives or false negatives more important?"},
{"author": "Data Scientist at Capital One was asked...", "question": " How do you learn something new?"},
{"author": "Data Scientist at Municipal Credit Union was asked...", "question": " if I would consent to a background and credit check"},
{"author": "Data Scientist at Capital One was asked...", "question": " Describe a time you worked on a team."},
{"author": "Data Scientist at Capital One was asked...", "question": " Difference between random forest and gradient boosted tree."},
{"author": "Data Scientist at Capital One was asked...", "question": " What does regularization do?"},
{"author": "Data Scientist at Capital One was asked...", "question": " Write pseudocode for map reduce"},
{"author": "Data Scientist at BlueMountain Capital Management was asked...", "question": " how to compute median of lots (and lots of) data in 10 computers when it is costly to do big cross-computer calculations"},
{"author": "Data Scientist at Facebook was asked...", "question": " If you implement a new feature to FB how would you measure the success"},
{"author": "Data Scientist at Facebook was asked...", "question": " some sql question dealing with join func"},
{"author": "Data Scientist at Ellington Management Group was asked...", "question": " This is the dataset that we are working on. Which aspects are you going to look at, and how?"},
{"author": "Data Scientist at Tapad was asked...", "question": " The first round is about the machine learning knowledge, there are 2 interviewers from data science team and all of them are PhD. They ask me about my experience and projects on my resume. The question are very detail, and you need know very well about your project. They also introduce to me about what they do in the data science team. The second round is a coding interview. The interviewer ask me to write a specific class using python. I was not very familiar with the top programming, and the interviewer gave me an detail example and a lot of hints to guide me finish the process. The two rounds onsite interview and the interviewers are all very nice."},
{"author": "Data Scientist at 1010data was asked...", "question": " probability question machine learning algorithm"},
{"author": "Data Scientist at Nielsen was asked...", "question": " How would you get all the unique values from an attribute in R?"},
{"author": "Data Scientist at Commonwealth Bank of Australia was asked...", "question": " I was asked 2 programming questions and a predictive modeling question, and had to present on a whiteboard to the interviewer."},
{"author": "Associate Data Scientist at First Derivatives was asked...", "question": " Why first derivatives? What do you know about us? What was your favorite college course and why? "},
{"author": "Data Scientist at Wink was asked...", "question": " sketch a sudo code to check if Sudoku (the game) is Right."},
{"author": "Data Scientist at Cablevision Systems was asked...", "question": " What is random forest?"},
{"author": "New Graduate Data Scientist at Visa Inc. was asked...", "question": " 4 MCQs"},
{"author": "New Graduate Data Scientist at Visa Inc. was asked...", "question": " 3 coding challenge"},
{"author": "Data Scientist at CKM Advisors was asked...", "question": " Questions on the logic of my code in the data analytics homework exercise. Heavy focus on defending my recommendations by referencing my analysis. "},
{"author": "Data Scientist at SITO Mobile was asked...", "question": " Experience with geospatial data"},
{"author": "Data Scientist at Gust was asked...", "question": " data challenge using postgresql"},
{"author": "Data Scientist at Clover Health was asked...", "question": " Questions on probability"},
{"author": "Data Scientist at IBM was asked...", "question": " Easy questions"},
{"author": "Data Scientist at CKM Advisors was asked...", "question": " NDA"},
{"author": "Data Scientist at iDigerati was asked...", "question": " What is my weakness?"},
{"author": "Data Scientist at Quicken Loans was asked...", "question": " Why QL?"},
{"author": "Data Scientist at TIBCO Software was asked...", "question": " Something like \"select which attitude describes you in the following situation\""},
{"author": "Data Scientist at UnitedHealth Group was asked...", "question": " Simple programming questions to verify that you do know programming"},
{"author": "Principal Data Scientist at Via Transportation was asked...", "question": " Why do you want to work here?"},
{"author": "Data Scientist at Google was asked...", "question": " Explain a probability distribution that is not normal and how to apply that."},
{"author": "Data Scientist at J.P. Morgan was asked...", "question": " Find Intersection of 2 lists, describe various machine learning terms. Many algorithms questions."},
{"author": "Data Scientist at 1010data was asked...", "question": " What my goals are."},
{"author": "Data Scientist at Fulcrum Analytics was asked...", "question": " Machine Learning and Python basics. Missing values, imputing, and some aptitude math questions."},
{"author": "Data Scientist, Analytics at Facebook was asked...", "question": " 2 Questions for the half hour interview, one about the product sense, like how to detect the fake information input from the user. Another one is the SQL problem"},
{"author": "Data Scientist at Dataiku was asked...", "question": " What's your expectation for this internship position?"},
{"author": "Data Scientist at J.P. Morgan was asked...", "question": " Talk about your projects."},
{"author": "Data Scientist at Accenture was asked...", "question": " tell me about the time when you have solved a conflict at work."},
{"author": "Data Scientist at OnDeck was asked...", "question": " Typical algorithm questions - if a string is a palindrome, etc."},
{"author": "Data Scientist at FlightSafety International was asked...", "question": " What is the difference between a concrete class and an interface?"},
{"author": "Data Scientist at Amazon was asked...", "question": " tell me about lstm"},
{"author": "Data Scientist at Slalom was asked...", "question": " Some machine learning question"},
{"author": "Applied Data Scientist at ThetaRay was asked...", "question": " Describe a time when you were unsuccessful at achieving a goal."},
{"author": "Data Scientist at BD was asked...", "question": " How did you know about BD?"},
{"author": "Data Scientist at Facebook was asked...", "question": " It's a phone interview about technical question. About how to generate all possible friendship given four tables with the \"request\", \"accept\",\"reject\", and \"remove\" information."},
{"author": "Data Scientist at Con Edison was asked...", "question": " write a for loop to reverse a string by using python"},
{"author": "Data Scientist at Con Edison was asked...", "question": " find best func(x,y) given x and y"},
{"author": "Data Scientist at Con Edison was asked...", "question": " find second highest salary employee by using sql"},
{"author": "Data Scientist at Google was asked...", "question": " Describe the process of data analysis?"},
{"author": "Data Analyst/Data Scientist at Stash Invest was asked...", "question": " There were no technical questions aside from the pandas coding question I mentioned above."},
{"author": "Data Scientist at White Ops was asked...", "question": " Work I mentioned in my resume"},
{"author": "Data Scientist at Time Inc. was asked...", "question": " Define an algorithm for checking if a string is a palindrome"},
{"author": "Data Scientist at Caserta was asked...", "question": " Inspect a dataset to find potential issues."},
{"author": "Data Scientist at Munich Re was asked...", "question": " Talk about past projects and experience"},
{"author": "Data Scientist at Sabre was asked...", "question": " What is your most successful things? Why you choose Sabre? "},
{"author": "Senior Data Scientist at AIG was asked...", "question": " Random questions irrelevant to data science"},
{"author": "Senior Data Scientist at DigitalOcean was asked...", "question": " - Diagram a solution for a multi-modal document prediction task. - Explain overfitting in the context of various algorithms (SVM, random forest, neural network) and techniques to mitigate it (very technical on the details) - Explain how you would deal with class imbalance or other sources of bias in a training data set (again, very technical on the details) - Explain how you would use a Docker container to make a deployable machine learning service using Kubernetes (wanted many devops details). - Have you used a pipeline automation tool like Luigi? Have you used monitoring tools like PagerDuty?"},
{"author": "Financial Data Scientist at Bloomberg L.P. was asked...", "question": " Newton's method to calculate the square root"},
{"author": "Data Scientist at Simulmedia was asked...", "question": " General experience questions "},
{"author": "Data Scientist at BuzzFeed was asked...", "question": " Tell us a project you'd do at Buzzfeed."},
{"author": "Data Scientist at Aptus Health was asked...", "question": " I was presented with a problem that often comes up in the data, and how would I address it. "},
{"author": "Data Scientist at Fractal Analytics was asked...", "question": " Inference questions"},
{"author": "Data Scientist at Integral Ad Science was asked...", "question": " Data analysis, usual coding and stats questions"},
{"author": "Data Scientist at Bitly was asked...", "question": " We're interested in tracking users that may appear in our systems via many device ID's. That is, someone may click a Bitly link from a mobile device, and at another time, that same user may click another Bitly link from a laptop at home. We only have these device ID's in addition to sites visited and other metadata, and we would like to attribute these actions to the same user across devices. How would you approach this problem?"},
{"author": "Data Scientist/Consultant at EY was asked...", "question": " Most questions are related to experience/skills mentioned on resume. For data science, machine learning and statistical techniques are of interest and questions related to these should be expected."},
{"author": "Data Scientist at Munich Re was asked...", "question": " What are the projects you have done in your current company?"},
{"author": "Associate Data Scientist at 360i was asked...", "question": " Asked about previous experience"},
{"author": "Data Scientist at Zocdoc was asked...", "question": " general experience and machine learning"},
{"author": "Data Scientist at Goldman Sachs was asked...", "question": " How would you prove that the square root of two is irrational?"},
{"author": "Data Scientist at Applecart was asked...", "question": " would you sign a NDA and do our coding challenge?"},
{"author": "Client Data Scientist at DemystData was asked...", "question": " 1) When would you use simple Train\\Test\\Validation Vs K-Cross Validation? 2) How would you implement a predictive model for a specific used case in the banking industry (like Fraud Detection, Credit Risk etc)? "},
{"author": "Data Scientist at Quantilus was asked...", "question": " We were asked about our previous project."},
{"author": "Data Scientist at Argo Group was asked...", "question": " The more technical questions were based on projects I had worked on and how I approached them."},
{"author": "Data Scientist at Integral Ad Science was asked...", "question": " describe your solution to the assignment"},
{"author": "Data Scientist at Rang Technologies was asked...", "question": " Q: Would you be okay with me increasing your work experience?"},
{"author": "Data Scientist at OnDeck was asked...", "question": " Algorithm questions, basic statistics, questions about my background"},
{"author": "Data Scientist at Rang Technologies was asked...", "question": " Q: Tell me about yourself."},
{"author": "Data Scientist at Rang Technologies was asked...", "question": " Q: Tell me about yourself."},
{"author": "Image Data Scientist at Merck was asked...", "question": " Question about my research and published papers."},
{"author": "Data Scientist at Rang Technologies was asked...", "question": " What is your salary expectation, what is your experience blablabla"},
{"author": "Data Scientist at Etsy was asked...", "question": " How do you know if the data are overfitted?"},
{"author": "Data Scientist at Etsy was asked...", "question": " How would you evaluate your binary classifier?"},
{"author": "Data Scientist at Zillow was asked...", "question": " What analytics skills do you have?"},
{"author": "Data Scientist at Bayer was asked...", "question": " What are you a good fit?"},
{"author": "Research Lead/Data Scientist at Spotify was asked...", "question": " How would you detect anomalous behavior? How would you generate profiles of users? The questions came up in the course of conversation though (i.e. in response to things I had said)"},
{"author": "Data Scientist at Quora, Inc. was asked...", "question": " What features do you like about Quora. How can you improve Quora."},
{"author": "Data Scientist at M Science was asked...", "question": " A balanced mix of questions about my equity markets experience, programming and statistics ability"},
{"author": "R&D at Philips was asked...", "question": " Behavioral questions, and a few about past projects in school related to the job. Interviewer was very friendly."},
{"author": "Data Scientist at 1010data was asked...", "question": " How would you know if a grocery store is out of stock on one specific item based looking at the total transaction database of the store?"},
{"author": "Data Scientist Phd at Etsy was asked...", "question": " How would you evaluate your binary classifier? "},
{"author": "Data Scientist at Pulse Data was asked...", "question": " A lot of probability questions"},
{"author": "Data Scientist at CKM Advisors was asked...", "question": " Walk through the idea and code behind a technical project that you've worked on."},
{"author": "Data Scientist Phd at Etsy was asked...", "question": " How do you know if the data are overfitted? "},
{"author": "Data Scientist Phd at Etsy was asked...", "question": " What’s Bayesian Logistic Regression?"},
{"author": "Data Scientist at Cambia Health Solutions was asked...", "question": " resume questions and follow ups"},
{"author": "Data Scientist at Affirm was asked...", "question": " Does an ROC curve change if you square the outputs used to generate it?"},
{"author": "Data Scientist at Rang Technologies was asked...", "question": " Describe a situation when you used SAS."},
{"author": "Data Scientist at Komodo Health was asked...", "question": " Walk through a bayesian probability question theoretically then code in Python. "},
{"author": "Data Scientist at Facebook was asked...", "question": " What function in R allows you to select rows>"},
{"author": "Data Scientist at Bluecore was asked...", "question": " Build a personalized recommendation model."},
{"author": "Data Scientist at ActionIQ was asked...", "question": " data science challenge"},
{"author": "Data Scientist at Nirvana Enterprises was asked...", "question": " I was given different scenarios and asked, how would I solve it or approach the business problems as \"Data Scientist\". He helped me understand bigger picture and different possible approaches to solve the problem efficiently. "},
{"author": "Data Scientist at AltX was asked...", "question": " What's your employment status?"},
{"author": "Data Scientist at Facebook was asked...", "question": " What is data science?"},
{"author": "Data Scientist at YOP IT Solutions was asked...", "question": " More into Python coding"},
{"author": "Data Scientist at Stash Invest was asked...", "question": " Explain difference between bagging vs boosting"},
{"author": "Data Scientist at Squarespace was asked...", "question": " If we were to take our product international, what would you do?"},
{"author": "Data Scientist at McKinsey & Company was asked...", "question": " Previous experiences (very detailed) and why I'd like to join McKinsey"},
{"author": "Data Scientist Internship at Annalect was asked...", "question": " What project do you want to participate in any company?"},
{"author": "Data Scientist at Bloomberg L.P. was asked...", "question": " general questions about machine learning and C++"},
{"author": "Senior Data Scientist at Transfix was asked...", "question": " Describe the responsibilities etc. of your last role as if you were onboarding a new person."},
{"author": "Senior Data Scientist at Lumos Labs was asked...", "question": " take home assignment"},
{"author": "Data Scientist at AdTheorent was asked...", "question": " 1st data scientist: The wind question (below) but I had to go very in depth about why I would choose Monday or Tuesday and had to actually write out the equations and explain why which one is better. I also had a question about shuffling cards and I had think of a really efficient way to do it. The second interview had a lot of questions about Python and R like about what the data structures are and their definitions. I think I also had some questions about linear regression as well. "},
{"author": "Data Scientist at CKM Advisors was asked...", "question": " Given an ambiguous data set and corresponding business problem, how would I generally go about solving it, i.e. what steps would I first take?"},
{"author": "Data Scientist at Aetna was asked...", "question": " How would you prevent unnecessary ER visits."},
{"author": "Data Scientist at Dataminr was asked...", "question": " questions about the project. algorithm questions. High level interviews with executives."},
{"author": "Data Scientist at Facebook was asked...", "question": " SQL question: given a table of interaction between users (user_a | user_b | day), find number of users who had more than 5 interactions yesterday (assume there is only one unique interaction between a pair of users per day). Product Question: A user satisfaction survey was conducted for two groups of facebook users (each with 50 k sample size). Group1: who had enabled certain login security features Group 2: who had not enabled these security features. It was found that user satisfaction with group1 was 30% lower than with group 2. Why do you think so? Comment on how the survey was conducted?"},
{"author": "Data Scientist at Bowery Farming was asked...", "question": " The take-home consisted of a dataset and some open-ended questions. It was pretty fun in the end, and seemingly representative of standard problems one would encounter in the day-to-day."},
{"author": "Data Scientist at AIG was asked...", "question": " How to tell the difference between classifiers. what is the difference between Lasso and Ridge regression?"},
{"author": "Data Scientist at Capital One was asked...", "question": " What's the distribution looks like of the number of daily trips in NYC"},
{"author": "Data Scientist Engineer at BeenVerified.com was asked...", "question": " Describe your experience at Company X"},
{"author": "Data Scientist, AWS Professional Services at Amazon was asked...", "question": " Tell me about a time you took a risk and it didn't work out"},
{"author": "Data Scientist at Nielsen was asked...", "question": " Why Nielsen?"},
{"author": "Data Scientist at Nielsen was asked...", "question": " What is your favorite statistical test?"},
{"author": "Data Scientist at Palantir Technologies was asked...", "question": " Fairly straightforward stats question requiring knowledge of Bayes rule. Also a programming question involving some kind of sorting (can't remember the exact details)."},
{"author": "Client Data Scientist at DemystData was asked...", "question": " How would a financial institution determine if an applicant makes more or less than $50k/yr"},
{"author": "Data Scientist at BlueMountain Capital Management was asked...", "question": " How to solve a linear regression on trillions of rows with very limited memory?"},
{"author": "Data Scientist at BlueMountain Capital Management was asked...", "question": " How to use distributed system to calculate median number of terabytes of data?"},
{"author": "Data Scientist at BlueMountain Capital Management was asked...", "question": " How to find trading signals from prescription documents (with drug names)? And how to deal with typo in drug names?"},
{"author": "Data Scientist at Nielsen was asked...", "question": " Do you use R or R Studio?"},
{"author": "Data Scientist at Hackensack Meridian Health was asked...", "question": " What are your major projects and what were your learnings from them?"},
{"author": "Data Scientist at Nielsen was asked...", "question": " What do you do on the weekends?"},
{"author": "Data Scientist at Facebook was asked...", "question": " How would you measure or determine someone to be your best friend on Facebook? What would this look like and how would you approach it?"},
{"author": "Data Scientist at Facebook was asked...", "question": " Determime fraction of active users messagong at least 5 people in a given day."},
{"author": "Data Scientist at Tapad was asked...", "question": " describe recent data science project & probability question"},
{"author": "Data Scientist at Enlitic was asked...", "question": " project from resume, some coding exercise. "},
{"author": "Data Scientist at Blueprint Health was asked...", "question": " No specific professional questions."},
{"author": "Data Scientist at Via Transportation was asked...", "question": " Tell me what features we can use to evaluate driver performance and how would you model them."},
{"author": "Data Scientist at Quartet Health was asked...", "question": " Review past projects"},
{"author": "Senior Data Scientist at SG Analytics was asked...", "question": " They asked what packages I've used, such as Pandas, and how I've used them. They also asked about my project experience. The last question I could not answer at all - it was about how I would approach a problem for which analytics were not yet developed, and how I would know to be satisfied with the result for the client."},
{"author": "Senior Data Scientist at SG Analytics was asked...", "question": " Have you worked with APIs?"},
{"author": "Data Scientist at The Wine Group was asked...", "question": " No question was difficult, everything from the resume"},
{"author": "Data Scientist at Integral Ad Science was asked...", "question": " Questions on probability, algorithms, map reduce, machine learning, ad tech related problems."},
{"author": "Data Scientist at Quartet Health was asked...", "question": " They asked me to walk through a machine learning problem and poked a lot of wholes to make sure I knew what I was doing."},
{"author": "Data Scientist at Facebook was asked...", "question": " Why Facebook? What is probability of pulling a different color or shape card from a shuttled deck of 52 cards? A business sense question on how to improve a service and a sql query question given a table."},
{"author": "Data Scientist at KPMG was asked...", "question": " How do you work with a data set that has 500 features?"},
{"author": "Data Scientist at Applecart was asked...", "question": " The exercise was to involved predicting election outcomes utilizing various data sets. What is the best evaluation criteria for predicting probabilistic outcomes of your model?"},
{"author": "Data Scientist at Quartet Health was asked...", "question": " They asked me to whiteboard a coding problem."},
{"author": "Data Scientist at Quartet Health was asked...", "question": " They asked some data engineering questions."},
{"author": "Data Scientist at Quartet Health was asked...", "question": " They asked me to solve a brainteaser on the white board while they returned emails and didn't engage with me at all."},
{"author": "Data Scientist at McKinsey & Company was asked...", "question": " All interviews (except for the HR screening) comprised 2 parts. A personal experience question, where you had to get into details about previous projects you had worked on (in data science). And then the 2nd part was always a case study (typically with an analytics twist)."},
{"author": "Data Scientist at FINRA was asked...", "question": " 1. Prove why Pearson's Correlation is between -1 and 1. 2. Linear regression, multiple linear regression, brainteasers, programming exercise"},
{"author": "Data Scientist at KP was asked...", "question": " where do you see yourself in 5 years"},
{"author": "Data Scientist at Via Transportation was asked...", "question": " What would you do to measure the efficiency of the upper east side?"},
{"author": "Professional English Faculty at Institute of Language Management was asked...", "question": " Why you have chosen this company to work?"},
{"author": "Data Scientist at AKUNA CAPITAL was asked...", "question": " Complex Algorithm and Object oriented question which ibviously took lot more time than they gave"},
{"author": "Data Scientist at Aetna was asked...", "question": " Extrapolate how many blood testing centers there are in the United States. "},
{"author": "Data Scientist at Capital One was asked...", "question": " To finish a data challenge without a deadline given."},
{"author": "Data Scientist at Yelp was asked...", "question": " How to evaluate the features classifying spams and emails."},
{"author": "Data Scientist at J.P. Morgan was asked...", "question": " did you code machine learning algorithms from scratch or used a library?"},
{"author": "Data Scientist at J.P. Morgan was asked...", "question": " The two interviews had a similar format. It started with an overview of my education, experience and past projects. Asked specific and technical details on the implementation of a neural network algorithm. I was then asked to solve small coding problems via collabedit: 1. Find the intersection of two arrays of integers. 2. Find the nth prime number 3. Use a binary search to find the index of a given value within an array of integers. 4. An SQL exercise to extract various specific items of a table. For the coding exercises I could choose the language of my choice. Complexity was discussed and the interviewer always pushed me to find the least demanding solution in terms of time complexity."},
{"author": "Data Scientist at Xerox was asked...", "question": " Detailed Machine learning algorithms and pattern recognition methods with their objective functions"},
{"author": "Data Scientist at Dataiku was asked...", "question": " why i wanted this job"},
{"author": "Data Scientist at OnDeck was asked...", "question": " Technical test of probability simulation and a variety of Python and SQL questions in person."},
{"author": "Research Lead/Data Scientist at Spotify was asked...", "question": " They sent a link to some publicly-available data and told me to tell them something interesting about it."},
{"author": "Junior Data Scientist at Allstate was asked...", "question": " If a jar has X red balls and Y blue balls, what is the minimum number of draws that is necessary to ensure that you have one ball of each color?"},
{"author": "Data Scientist at 1010data was asked...", "question": " How would you explain recursion to someone who didn't understand com sci?"},
{"author": "Data Scientist at Oscar Health was asked...", "question": " Debate question: \"Are state lotteries a good idea?\" Coding question: Easy-level leet-code style problem --- using a list of start and end-time tuples representing room occupancies, determine if there are conflicts and how many."},
{"author": "Data Scientist at McKinsey & Company was asked...", "question": " Writing an algorithm for time series data"},
{"author": "Data Scientist at Dynamit was asked...", "question": " how do you handle difficult co-workers"},
{"author": "Data Scientist at Cablevision Systems was asked...", "question": " Explain the KNN algorithm"},
{"author": "Data Scientist at Audible was asked...", "question": " Talk through how you would build a recommendation system."},
{"author": "Data Scientist at Audible was asked...", "question": " Why Audible? "},
{"author": "Data Scientist/Machine Learning at Manthan was asked...", "question": " Describe role and responsibilities on one project"},
{"author": "Data Scientist at Jet was asked...", "question": " functional programming"}
]